app/views/users/edit.html.erb

    <h1>Edit User</h1>
    <%= link_to "Return to your profile", user_path(User.find(session[:user_id])), class: "profile-link" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]