app/helpers/application_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    return nil if logged_in_user_id.nil?

    User.find(logged_in_user_id)