app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
---
  def index
    redirect_to root_path if session[:user_id].nil?
    @groups = Group.all.includes(avatar_attachment: [:blob])

INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test_group_1"], ["created_at", "2020-10-11 17:25:03.174487"], ["updated_at", "2020-10-11 17:25:03.174487"]]
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test_group"], ["created_at", "2020-10-11 17:22:42.410108"], ["updated_at", "2020-10-11 17:22:42.410108"]]
---
   def create
    group = Group.create!(group_params)
    group.avatar.attach(params[:group][:avatar])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" INNER JOIN "group_transactions" ON "transactions"."id" = "group_transactions"."transaction_id" WHERE "group_transactions"."group_id" = $1  [["group_id", 6]]
---
  def show
    redirect_to root_path if session[:user_id].nil?
    @group = Group.find(params[:id])
    @transactions = @group.transactions.includes(user: [avatar_attachment: :blob])