app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 11]]
SELECT 1 AS one FROM "transactions" WHERE "transactions"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
SELECT 1 AS one FROM "groups" INNER JOIN "group_transactions" ON "groups"."id" = "group_transactions"."group_id" WHERE "group_transactions"."transaction_id" = $1 LIMIT $2  [["transaction_id", 47], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN ($1, $2, $3)  [["id", 7], ["id", 8], ["id", 11]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT SUM("transactions"."amount") FROM "transactions" LEFT OUTER JOIN "group_transactions" ON "group_transactions"."transaction_id" = "transactions"."id" LEFT OUTER JOIN "groups" ON "groups"."id" = "group_transactions"."group_id" LEFT OUTER JOIN "active_storage_attachments" ON "active_storage_attachments"."record_type" = $1 AND "active_storage_attachments"."name" = $2 AND "active_storage_attachments"."record_id" = "groups"."id" LEFT OUTER JOIN "active_storage_blobs" ON "active_storage_blobs"."id" = "active_storage_attachments"."blob_id" WHERE "transactions"."user_id" = $3  [["record_type", "Group"], ["name", "avatar"], ["user_id", 11]]
---
  def index
    redirect_to root_path if session[:user_id].nil?
    @transactions = Transaction.where(user_id: session[:user_id]).includes(groups: [avatar_attachment: :blob])
    @transactions = @transactions.filter { |trans| !trans.groups.empty? }
    @total_transactions_value = 0
    @transactions.each { |trans| @total_transactions_value += trans.amount }

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
---
  def new
    redirect_to root_path if session[:user_id].nil?
    user = User.find(session[:user_id])
    @transaction = user.transactions.build
    @groups = Group.all

INSERT INTO "transactions" ("user_id", "name", "amount", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 11], ["name", "test!"], ["amount", 1.0], ["created_at", "2020-10-14 09:01:49.575610"], ["updated_at", "2020-10-14 09:01:49.575610"], ["description", "I had to look after the dog"]]
INSERT INTO "group_transactions" ("group_id", "transaction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 9], ["transaction_id", 68], ["created_at", "2020-10-14 09:03:39.147319"], ["updated_at", "2020-10-14 09:03:39.147319"]]
SELECT "group_transactions".* FROM "group_transactions" WHERE "group_transactions"."group_id" IS NULL AND "group_transactions"."transaction_id" = $1  [["transaction_id", 1]]
SELECT "groups".* FROM "groups"
---
  def create
    redirect_to root_path if session[:user_id].nil?


    @transaction = Transaction.new(transaction_params.except(:group_ids))
    @transaction.user_id = session[:user_id]
    if @transaction.save
      GroupTransaction.create(transaction_id: @transaction.id) if params[:transaction][:group_ids].all?('0')
      params[:transaction][:group_ids].reject { |n| n.to_i.zero? }.each do |id|
        GroupTransaction.create(group_id: id.to_i, transaction_id: @transaction.id)
      end
      redirect_to transaction_path(@transaction)
    else
      @groups = Group.all

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14)  [["id", 42], ["id", 44], ["id", 45], ["id", 46], ["id", 47], ["id", 48], ["id", 49], ["id", 53], ["id", 54], ["id", 55], ["id", 56], ["id", 57], ["id", 63], ["id", 68]]
---
  def show
    redirect_to root_path if session[:user_id].nil?
    @transaction = Transaction.find(params[:id])

SELECT "transactions".* FROM "transactions"
SELECT "groups"."id" FROM "groups" INNER JOIN "group_transactions" ON "groups"."id" = "group_transactions"."group_id" WHERE "group_transactions"."transaction_id" = $1  [["transaction_id", 59]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 10], ["id", 11], ["id", 12]]
SELECT 1 AS one FROM "groups" INNER JOIN "group_transactions" ON "groups"."id" = "group_transactions"."group_id" WHERE "group_transactions"."transaction_id" = $1 LIMIT $2  [["transaction_id", 13], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN ($1, $2, $3, $4)  [["id", 7], ["id", 8], ["id", 11], ["id", 9]]
---
  def external_transactions
    @transactions = Transaction.includes(%i[groups user]).select do |trans|
      trans.groups.empty? && trans.user.id == session[:user_id]
    end
    @total_transactions_value = 0
    @transactions.each { |trans| @total_transactions_value += trans.amount }