app/controllers/transactions_controller.rb

  def create
    redirect_to root_path if session[:user_id].nil?
    @transaction = Transaction.new(transaction_params.except(:group_ids))
    @transaction.user_id = session[:user_id]
    @transaction.save
    GroupTransaction.create(transaction_id: @transaction.id) if params[:transaction][:group_ids].all?('0')
---
SELECT "group_transactions".* FROM "group_transactions" WHERE "group_transactions"."transaction_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11)