app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    redirect_to root_path if session[:user_id].nil?
    @transaction = User.find(session[:user_id]).transactions.build(transaction_params)