app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def create
    @user = User.new(user_params.except(:avatar))
    @user.valid?
    if @user.save
      session[:user_id] = @user.id
      @user.avatar.attach(params[:user][:avatar])
      redirect_to user_path(@user)
    else
      render "users/new" if @user.errors.any?