app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    redirect_to root_path if session[:user_id].nil?
    @users = User.all

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Joe"], ["created_at", "2020-09-27 08:44:14.579333"], ["updated_at", "2020-09-27 08:44:14.579333"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test_one"], ["created_at", "2020-10-10 09:13:50.964327"], ["updated_at", "2020-10-10 09:13:50.964327"]]
---
  def create
    user = User.create!(user_params)
    session[:user_id] = user.id
    user.avatar.attach(params[:user][:avatar])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
---
  def show
    redirect_to root_path if session[:user_id].nil?
    @user = User.find(params[:id])
    @transactions = Transaction.where(user_id: @user.id).reject(&:nil?)
    @external_transactions = Transaction.where(user_id: @user.id).select(&:nil?)
    @groups = Group.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2020-10-13 07:46:00.962979"], ["id", 12]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)