app/views/transactions/_transaction_list.html.erb

SELECT "groups".* FROM "groups" INNER JOIN "group_transactions" ON "groups"."id" = "group_transactions"."group_id" WHERE "group_transactions"."transaction_id" = $1 ORDER BY "groups"."id" ASC LIMIT $2  [["transaction_id", 47], ["LIMIT", 1]]
SELECT 1 AS one FROM "groups" INNER JOIN "group_transactions" ON "groups"."id" = "group_transactions"."group_id" WHERE "group_transactions"."transaction_id" = $1 LIMIT $2  [["transaction_id", 58], ["LIMIT", 1]]
---
        src= <%= "#{
          transaction.groups.empty? || !transaction.groups.first.avatar.attached? ? 'paw.png' : url_for(transaction.groups.first.avatar)

SELECT "groups"."id" FROM "groups" INNER JOIN "group_transactions" ON "groups"."id" = "group_transactions"."group_id" WHERE "group_transactions"."transaction_id" = $1  [["transaction_id", 47]]
---
            :transaction=> {
              name: transaction.name,
              amount: transaction.amount,
              description: transaction.description,
              group_ids: transaction.groups.empty? ? [0] : transaction.groups.ids