app/views/transactions/show.html.erb

    <h1>Transaction Details</h1>
    <%= link_to "Return to your profile", user_path(User.find(session[:user_id])), class: "profile-link" %>w
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

      <div class="title-wrapper">
        <% if @transaction.groups.empty? %>
---
SELECT "groups".* FROM "groups" INNER JOIN "group_transactions" ON "groups"."id" = "group_transactions"."group_id" WHERE "group_transactions"."transaction_id" = $1 ORDER BY "groups"."id" ASC LIMIT $2  [["transaction_id", 12], ["LIMIT", 1]]
SELECT 1 AS one FROM "groups" INNER JOIN "group_transactions" ON "groups"."id" = "group_transactions"."group_id" WHERE "group_transactions"."transaction_id" = $1 LIMIT $2  [["transaction_id", 48], ["LIMIT", 1]]

        <% else %>
          <img class="image" src= <%= "#{url_for(@transaction.groups.first.avatar)}" %>>
---
SELECT "groups".* FROM "groups" INNER JOIN "group_transactions" ON "groups"."id" = "group_transactions"."group_id" WHERE "group_transactions"."transaction_id" = $1 ORDER BY "groups"."id" ASC LIMIT $2  [["transaction_id", 48], ["LIMIT", 1]]